{"pageProps":{"item":{"path":"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-in-neverwhere.md","date":"2012-03-08","slug":"skeezix-in-neverwhere","title":"Skeezix in Neverwhere","img":"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail3.jpg"},"htmlPost":"<p> My buddy Kathleen gave me this antique German Bisque doll, sans head, and the doll had SKEEZIX embossed across the back of his shoulders. It was a name I recalled having heard from my parents when I was young, but I had no idea who he was. So I did a little Wikipedia research. Apparently he came from the very old comic strip “Gasoline Alley” (see article posted below).</p>\n<p> Neverwhere is the title of the book I’m currently reading, I’ll post some info on that below also.</p>\n<p> Together, the doll and the novel helped me create this Assemblage. I wanted to experiment with doing my mosaic/sculpture type stuff INSIDE A FRAME to see if it would be easier to sell artwork in the gallery if it was framed and hangable. I had this feeling that people have trouble buying a sculpture because they wonder how to display it properly, or WHERE to display it properly, whereas a painting, or framed piece of artwork is easy, you bring it home and hang it on a wall.</p>\n<p> So I found this old mirror, the type where the silver backing is all spotted. The frame around it was also mirrored, and spotted. The orange and light green glass was from two “crackle glass” type vases I picked up at the goodwill store. The dark grey stone is slate I had left over from the mosaic fireplace I did recently. The wings I added to skeezix were from a 99 cent angel I found t the goodwill store. After everything was glued to the mirror, I poured clear epoxy resin over it, about 1/4″ thick, that encased all the pieces, except for skeezix, who is breaking free.</p>\n<p> <a href=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail3.jpg\"><img src=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail3.jpg?w=487\" alt=\"Image\"></a></p>\n<p> <a href=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail1.jpg\"><img src=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail1.jpg?w=487\" alt=\"Image\"></a></p>\n<p> <a href=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail5.jpg\"><img src=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail5.jpg?w=487\" alt=\"Image\"></a></p>\n<p> <a href=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail6.jpg\"><img src=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezix-detail6.jpg?w=487\" alt=\"Image\"></a></p>\n<p> <a href=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezixinneverwhere.jpg\"><img src=\"//assemblique.s3.us-east-2.amazonaws.com/2012/03/skeezixinneverwhere.jpg?w=487\" alt=\"Image\"></a></p>\n<h6 id=\"about-skeezix-from-wikipedia\">ABOUT SKEEZIX: (from Wikipedia)</h6>\n<h6 id=\"early-years\">Early years</h6>\n<p> The strip originated on the <em>Chicago Tribune’</em>s black-and-white Sunday page, <em>The Rectangle</em>, where staff artists contributed one-shot panels, continuing plots or themes. One corner of <em>The Rectangle</em> introduced King’s <em>Gasoline Alley</em>, where characters Walt, Doc, Avery and Bill held weekly conversations about automobiles. This panel slowly gained recognition, and the daily strip began August 24, 1919 in the <em>New York Daily News</em>.  ###### Skeezix arrives</p>\n<p> The early years were dominated by the character Walt Wallet. <em>Tribune</em> editor Joseph Patterson wanted to attract women to the strip by introducing a baby, but Walt was not married. That obstacle was avoided when Walt found a baby on his doorstep, as described by comics historian Don Markstein:  <a href=\"http://en.wikipedia.org/wiki/File:Skeezixandnina.jpg\"><img src=\"https://i0.wp.com/upload.wikimedia.org/wikipedia/en/thumb/9/9d/Skeezixandnina.jpg/220px-Skeezixandnina.jpg\" alt=\"\"></a>   <a href=\"http://en.wikipedia.org/wiki/File:Skeezixandnina.jpg\" title=\"Enlarge\"><img src=\"https://i0.wp.com/bits.wikimedia.org/skins-1.17/common/images/magnify-clip.png\" alt=\"\"></a> Promotional art by Frank King (c. 1941), highlighting Skeezix’s marriage proposal to Nina Clock.</p>\n<p>   After a couple of years, the <em>Tribune’</em>s editor, Captain Joseph Patterson, whose influence would later have profound effects on such strips as <em>Terry and the Pirates</em> and <em>Little Orphan Annie</em>, decided the strip should have something to appeal to women, as well, and suggested King add a baby. Only problem was the main character, Walt Wallet, was a confirmed bachelor. On February 14, 1921, Walt found the necessary baby abandoned on his doorstep. That was the day <em>Gasoline Alley</em> entered history as the first comic strip in which the characters aged normally. (Hairbreadth Harry had grown up in his strip, but stopped aging in his early 20s.) The baby, named Skeezix (cowboy slang for a motherless calf), grew up, fought in World War II, and is now a retired grandfather. Walt married after all, and had more children, who had children of their own. More characters entered the storyline on the periphery and some grew to occupy center stage.  Skeezix called his adopted father Uncle Walt. Unlike most comic strip children (like the Katzenjammer Kids or Little Orphan Annie) he did not remain a baby or even a little boy for long. He grew up to manhood, the first occasion where real time continually elapsed in a major comic strip over generations. By the time the United States entered World War II, Skeezix was a fully-grown adult, courting girls and serving in the armed forces. He later married Nina Clock and had children. In the late 1960s he faced a typical midlife crisis. Walt Wallet himself had married Phyllis Blossom and had other children, who grew up and had kids of their own. During the 1970s and 1980s, under Dick Moores’ authorship, the characters briefly stopped aging. When Jim Scancarelli took over, the natural aging was restored. ###### About NEVERWHERE: (from Amazon)</p>\n<p> Neverwhere is the companion novelization by Neil Gaiman of the television serial Neverwhere, by Neil Gaiman and Lenny Henry. The plot and characters are exactly the same as in the series, with the exception that the novel form allowed Gaiman to expand and elaborate on certain elements of the story and restore changes made in the televised version from his original plans. Most notable is the appearance of the Floating Market at Harrods (in the novel) rather than under Battersea power station (the tv series). This was changed due to the management of Harrods changing their mind about proposed filming. The novel was originally released by BBC Books in 1996, three episodes into the television series run. It was accompanied by a spoken word CD and cassette release, also by the BBC. The novel enjoyed great success, whereas its television roots did not receive as much international exposure as the novel. In addition to being translated into various languages, it was also re-published as an ‘Author’s Preferred Text’ version, (a combination of the international and original English version, with additional scenes re-inserted by Gaiman) alongside American Gods in 2006. The original BBC Books version had a cover by long time Gaiman collaborator Dave McKean, taken from the birds head rings, flaming fist and London Underground styled graphics created by McKean for the series, as well as a brief section by Gaiman on the making of the series.</p>\n","title":"Skeezix in Neverwhere"},"__N_SSG":true}